In [1]:
#importing libraries
import pandas as pd
import numpy as np
from scipy.stats import norm 
from scipy import stats

# Cutlets

In [2]:
cutlets=pd.read_csv('D:ExcelR/Assignments/Downloaded/Hypothesis testing/Cutlets.csv')

In [3]:
cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [4]:
cutlets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [5]:
cutlets.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [6]:
A= norm.rvs(loc=7.019, scale= 0.288, size=35)
A

array([6.90372324, 6.60165626, 6.52904145, 7.61384924, 7.23605917,
       7.08470524, 6.60890869, 6.95932668, 6.53358641, 7.0282983 ,
       7.5993874 , 7.2692396 , 6.79876116, 7.07641513, 6.93706908,
       6.8358786 , 7.10380023, 7.00303366, 7.35865771, 7.08307252,
       6.79108319, 6.80621278, 6.88882543, 6.97578424, 7.41997754,
       7.31044403, 7.70271587, 7.21666232, 6.61387437, 7.84948065,
       7.19479894, 6.59193612, 6.87400701, 7.20511421, 6.72197916])

In [7]:
B= norm.rvs(loc=6.964, scale= 0.343, size=35)
B

array([6.51447738, 6.86573678, 6.66055177, 6.72449982, 6.97344391,
       7.01299778, 7.21010888, 6.53721429, 6.90202221, 7.37363918,
       6.96093051, 6.77086147, 7.00925437, 6.72507951, 7.03591862,
       7.27374304, 6.76980476, 7.55243802, 7.66304921, 6.90866923,
       7.48278083, 7.05525031, 6.80450683, 7.5554032 , 7.17066156,
       6.74980148, 7.41856175, 6.70972956, 7.01772117, 6.70990549,
       6.56507036, 6.6180059 , 7.05281954, 6.93605734, 7.47954155])

In [8]:
stats.ttest_ind(A,B)

Ttest_indResult(statistic=0.564943989604051, pvalue=0.5739709750188335)

we accept Null Hypothesis because pvalue is p>0.05, 
there is no significant difference in the diameter of the cutlet between two units

# LabTAT

In [9]:
LabTAT= pd.read_csv('D:/ExcelR/Assignments/Downloaded/Hypothesis testing/LabTAT.csv')

In [10]:
LabTAT.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [11]:
LabTAT.shape

(120, 4)

In [12]:
LabTAT.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [13]:
LabTAT.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [14]:
tstat,pvalue=stats.f_oneway(LabTAT.iloc[:,0],LabTAT.iloc[:,1],LabTAT.iloc[:,2],LabTAT.iloc[:,3])

In [15]:
tstat,pvalue

(118.70421654401437, 2.1156708949992414e-57)

p<0.05 we reject null hypothesis and accept alternative hypothesis

# BuyersRatio

In [16]:
buyersratio=pd.read_csv('D:/ExcelR/Assignments/Downloaded/Hypothesis testing/BuyerRatio.csv')

In [17]:
buyersratio.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [18]:
buyersratio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Observed Values  2 non-null      object
 1   East             2 non-null      int64
 2   West             2 non-null      int64
 3   North            2 non-null      int64
 4   South            2 non-null      int64
dtypes: int64(4), object(1)
memory usage: 208.0+ bytes

In [19]:
buyersratio.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [20]:
males =pd.Series([50,142,131,70])
females =pd.Series([435,1523,1356,750])

In [21]:
stats.ttest_ind(males,females)

Ttest_indResult(statistic=-3.5834877367684856, pvalue=0.011594334372357056)

p<0.05 we reject null hypothesis and accept alternative hypothesis, thus male-female buyer ratios are not similar across regions

# Costomer+OrderForm

In [22]:
cust=pd.read_csv('D:/ExcelR/Assignments/Downloaded/Hypothesis testing/Costomer+OrderForm.csv')

In [23]:
cust.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [24]:
cust.shape

(300, 4)

In [25]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [26]:
cust.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [30]:
freq =pd.Series([271,267,269,280])
defectiv =pd.Series([29,33,31,20])

In [31]:
stats.ttest_ind(freq,defectiv)

Ttest_indResult(statistic=60.02138859279744, pvalue=1.437376025121072e-09)

p<0.05 we reject null hypothesis and accept alternative hypothesis and the defective % varies by center